Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathUpdateMergedPointKeysStepFailed
Merging failed.

Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathLayoutStepFailed
Layout algorithm failed.

Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathInvalidNumberOfPoints
End indent is too large.

Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathIntersectionPolycurveParamsStepFailed
Intersection failed.

Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathIndentsOverlap
Beginning indent and end indent overlap.

Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathDistanceTooSmall
Distance is too small.

Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathCannotCreateFromGeometry
Highlighted geometry contains a path or edge that could not be divided.

Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathCannotBeMirroredWithoutItsCurves
Divided path cannot be mirrored without its curves.

Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathCannotApplyDivideSettings
Default Divide settings cannot be applied to Divided Path.

Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures
Failures related to divided path operations.